<template>
    <div>
    <div>
        <div class="paragraph-1">
            <h2>서체 <span>Font</span></h2>
        </div>
        <div class="paragraph paragraph-2">
            <h3>목적</h3>
            <p>
                메가스터디에 일관성을 유지하기 위한 타이포그래피 표준을 설정하는 것을 목적으로 합니다. 폰트 패밀리, 크기, 굵기, 간격을 정의함으로써 브랜드의 아이덴티티를 반영하고 최적의 가독성을 유지하는 통일된 사용자 경험을 제공하는 것이 목표입니다.
            </p>
        </div>
        <div class="paragraph paragraph-3">
            <h3>범위</h3>
            <p>
                메갓스터디의 모든 텍스트(시스템 폰트) 요소에 적용됩니다. 헤더, 본문 텍스트, 캡션, 강조된 콘텐츠 등이 포함되며, 디자이너와 개발자가 일관된 시각적 계층 구조와 접근 가능한 콘텐츠 레이아웃을 유지할 수 있도록 설계되었습니다.
            </p>
        </div>
        <div class="paragraph paragraph-4">
            <h3>핵심 원칙</h3>
            <h4>가독성</h4>
            <p>
                모든 폰트는 다양한 디바이스와 화면 크기에서 쉽게 읽힐 수 있어야 합니다. 선택된 폰트 패밀리와 크기는 데스크탑과 모바일 모두에서 최적화되어 있습니다.
            </p>
            <h4>일관성</h4>
            <p>
                페이지 간에 일관된 폰트 스타일을 사용하는 것은 사용자 경험을 개선하고 브랜드의 시각적 아이덴티티를 확립하는 데 도움이 됩니다.
            </p>
            <h4>접근성</h4>
            <p>
                적절한 대비와 폰트 크기는 시각 장애를 포함한 모든 사용자가 콘텐츠에 접근할 수 있도록 하는 데 중요합니다. 이 가이드는 다양한 환경에서 텍스트가 쉽게 읽히도록 보장합니다.
            </p>
        </div>
        <div class="paragraph paragraph-4">
            <h3>타이포그래피</h3>
            <h4>폰트 패밀리</h4>
            <p>
                주요 폰트: 헤더와 본문 텍스트에 사용되어 통일된 외관을 유지합니다.<br/>pretendard, Noto Sans, 맑은 고딕
            </p>
            <h4>폰트 크기</h4>
            <p>
                명확한 타이포그래피 크기 체계를 설정하여 시각적 계층 구조를 제공하고 사용자의 시선을 효과적으로 안내합니다.
                <br/><br/>
                헤더 크기: 헤더는 본문 텍스트와 확연한 크기 차이를 가져야 합니다.
                <br/>
                H1: 36px, H2: 30px, H3: 24px
                <br/><br/>
                본문 크기: 표준 본문 텍스트 크기는 편안한 읽기를 보장합니다.
                <br/>
                Body: 16px
            </p>
            <h4>줄 간격 및 간격</h4>
            <p>
                적절한 줄 간격과 텍스트 간격은 가독성과 전체적인 미관을 향상시킵니다.<br/>
                헤더: 1.2<br/>
                본문: 1.6
            </p>
            <h4>폰트 색상</h4>
            <p>
                헤더: 주의를 끌고 중요성을 부각시키기 위해 더 진한 색상을 사용합니다.<br/>
                예: #333333
                <br/><br/>
                본문: 눈의 피로를 줄이기 위해 약간 더 밝은 색상을 사용합니다.<br/>
                예: #4A4A4A
            </p>
        </div>
        <div class="paragraph paragraph-4">
            <h3>반응형 타이포그래피</h3>
            <p>폰트 크기는 다양한 화면 크기에 맞춰 유연하게 변경되어야 하며, 모바일, 태블릿, 데스크탑에서 최적의 읽기 경험을 제공해야 합니다. 가변적인 텍스트를 위해 상대적인 단위(예: em, rem)를 사용하는 것이 좋습니다.</p>
        </div>
        <div class="paragraph paragraph-5">
            <h3>반응형 타이포그래피</h3>
            <p>
                프리텐다드 18px Regular<br/>
                프리텐다드 18px Semibold<br/>
                프리텐다드 18px Bold
            </p>
        </div>
    </div>
    </div>
</template>
<script>
import '../../css/pages/intro.css';
export default {
    
}
</script>