<template>
    <div>
    <div>
        <div class="paragraph-1">
            <h2>디자인 원칙</h2>
            <p>'메가스터디 디자인 시스템'의 디자인 원칙은 모바일 및 태블릿 PC 환경에 최적화된 가이드라인을 제시하는 것입니다.</p>
        </div>
        <div class="paragraph paragraph-2">
            <h3>주요 방안</h3>
            <div>
                모바일 및 태블릿 PC 중심의 서비스를 제공하기 위해 다음 사항을 고려합니다.

                <ul class="paragraph-list">
                    <li>
                        <strong>간결한 콘텐츠</strong>
                        <p>
                            73%의 사용자 환경을 고려한 모바일 및 태블릿 PC 최적화를 통해 접근성을 높이고 사용자의 만족도를 높입니다.<br/>
                            * 2024년 서비스 이용 실태조사 결과 태블릿 사용자 비중 지속적 증가 추세 (73% 수준, AOS 69% / iOS 75%)
                        </p>
                    </li>
                    <li>
                        <strong>가독성</strong>
                        <p>
                            서비스의 모든 사용자 인터페이스(UI) 요소가 일관되게 디자인되도록 하여,<br/>사용자 경험(UX)을 개선하고 브랜드 아이덴티티를 강화합니다.
                        </p>
                    </li>
                    <li>
                        <strong>명확한 내비게이션</strong>
                        <p>
                            기획자, 디자이너, 퍼블리셔, 개발자 간의 원활한 커뮤니케이션과 협업을 지원하여 프로젝트 진행을 효율적으로 관리합니다.
                        </p>
                    </li>
                    <li>
                        <strong>아이콘</strong>
                        <p>
                            공통 구성 요소와 디자인 패턴을 정의하여 재사용 가능성을 높이고, 개발과 디자인 작업의 일관성을 유지합니다.
                        </p>
                    </li>
                    <li>
                        <strong>터치 제스처 지원</strong>
                        <p>
                            명확한 설계 및 구현 가이드를 제공하여 디자인과 개발 과정에서의 반복 작업과 오류를 줄이고, 시간을 절약합니다.
                        </p>
                    </li>
                    <li>
                        <strong>성능 최적화</strong>
                        <p>
                            명확한 설계 및 구현 가이드를 제공하여 디자인과 개발 과정에서의 반복 작업과 오류를 줄이고, 시간을 절약합니다.
                        </p>
                    </li>
                </ul>
            </div>
        </div>
        <div class="paragraph paragraph-3">
            <h3>개발 과정</h3>
            <div>
                본 디자인 시스템은 MVP(최소 기능 제품, Minimum Viable Product)로, 메가스터디 사이트에서 자주 사용되는 구성 요소와 반복적으로 발견되는 문제를 분석하여 사용자에게 일관된 UI/UX를 제공하고 작업 효율성을 높이기 위해 개발 범위를 설정하였습니다. 이 초기 버전에서 얻은 피드백을 바탕으로 지속적으로 개선을 진행할 예정입니다.
            </div>
        </div>
        <div class="paragraph paragraph-4">
            <h3>활용 범위</h3>
            <div>
                본 디자인 시스템은 메가스터디 웹사이트, 모바일 웹의 UI/UX 설계 및 개발에 참고할 수 있도록 개발되었습니다.
            </div>
        </div>
    </div>
    </div>
</template>
<script>
export default {
    
}
</script>